app/views/users/show.html.erb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
    <div class="col-md-6">
      <h1><%= @user.profile.first_name %> <%= @user.profile.last_name %><br/></h1>