app/controllers/profiles_controller.rb

  def create
    #Ensure that we have the user who is filling out form
    @user = User.find( params[:user_id] )
    #Create profile linked to this specific user
    @profile = @user.build_profile( profile_params )
    if @profile.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "profiles" ("user_id", "first_name", "last_name", "job_title", "phone_number", "contact_email", "description", "created_at", "updated_at", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @user = User.find( params[:user_id] )
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    # Retrieve the user from the database
    @user = User.find( params[:user_id] )
    # Retrieve that user's profile
    @profile = @user.profile
    # Mass assign edited profile attributes and save (update)
    if @profile.update_attgributes(profile_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "profiles" SET "job_title" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["job_title", "Investor"], ["updated_at", 2019-10-06 15:50:47 UTC], ["id", 3]]